btrails/app/controllers/profiles_controller.rb

  def update
    respond_to do |format|
      if @profile.update(profile_params)
---
UPDATE "profiles" SET "latest_point_lat" = $1, "latest_point_lng" = $2, "updated_at" = $3 WHERE "profiles"."id" = $4  [["latest_point_lat", 1.0], ["latest_point_lng", 2.0], ["updated_at", "2016-03-30 08:36:29.470073"], ["id", 1]]