btrails/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_salt", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "a@a.com"], ["password_salt", "$2a$10$UN5G7.yLQdKOElPGWVHWa."], ["created_at", "2016-03-31 08:51:19.862919"], ["updated_at", "2016-03-31 08:51:19.862919"]]
---
  def create
    @user = User.new(user_params)
    if @user.save