app/controllers/maps_controller.rb

  def index
    @point  = Point.where(profile_id: current_profile.id)
---
SELECT  "points".* FROM "points" WHERE "points"."profile_id" = $1 LIMIT 1  [["profile_id", 4]]

  def create

    point = Point.new(map_params)
    point.profile_id = current_profile.id

    respond_to do |format|
      if point.save
---
INSERT INTO "points" ("lat", "lng", "profile_id") VALUES ($1, $2, $3) RETURNING "id"  [["lat", "3.7590876956793777"], ["lng", "102.65625"], ["profile_id", 1]]