app/controllers/points_controller.rb

SELECT "points".* FROM "points" WHERE "points"."profile_id" = $1  [["profile_id", 1]]
---
  def index
    @points = Point.where(profile_id: current_profile.id)

UPDATE "points" SET "note" = $1 WHERE "points"."id" = $2  [["note", "A very pertinent note!"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @point.update(point_params)

SELECT  "points".* FROM "points" WHERE "points"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_point
      @point = Point.find(params[:id])