app/controllers/sessions_controller.rb

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1 LIMIT 1  [["user_id", 2]]
INSERT INTO "profiles" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 2], ["created_at", "2016-03-30 06:09:03.604252"], ["updated_at", "2016-03-30 06:09:03.604252"]]
---
  def create
    user = User.authenticate(params[:email], params[:password])
    if user
      session[:user_id] = user.id
      profile = Profile.find_by(user_id: user.id)
      if profile
        redirect_to profile_url profile.id, :notice => "Logged in"
      else
        profile = Profile.create(user_id: user.id)